Revit 2027 API
SizingOptions Constructor
Overload List
Name | Description
SizingOptions() |  Constructs a new instance of the SizingOptions with default parameters.
SizingOptions(Element) |  Constructs a new instance of the SizingOptions with specified parameters.
SizingOptions(SizingOptions) |  Constructs a new copy of the SizingOptions object.
Top
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace